MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128DA210/mcu.h
#define _G1CLUTRD_CLUTRD6_POSITION               0x00000006
#define _G1CLUTRD_CLUTRD6_MASK                   0x00000040
#define _G1CLUTRD_CLUTRD6_LENGTH                 0x00000001

#define _G1CLUTRD_CLUTRD7_POSITION               0x00000007
#define _G1CLUTRD_CLUTRD7_MASK                   0x00000080
#define _G1CLUTRD_CLUTRD7_LENGTH                 0x00000001

#define _G1CLUTRD_CLUTRD8_POSITION               0x00000008
#define _G1CLUTRD_CLUTRD8_MASK                   0x00000100
#define _G1CLUTRD_CLUTRD8_LENGTH                 0x00000001

#define _G1CLUTRD_CLUTRD9_POSITION               0x00000009
#define _G1CLUTRD_CLUTRD9_MASK                   0x00000200
#define _G1CLUTRD_CLUTRD9_LENGTH                 0x00000001

#define _G1CLUTRD_CLUTRD10_POSITION              0x0000000A
#define _G1CLUTRD_CLUTRD10_MASK                  0x00000400
#define _G1CLUTRD_CLUTRD10_LENGTH                0x00000001

#define _G1CLUTRD_CLUTRD11_POSITION              0x0000000B
#define _G1CLUTRD_CLUTRD11_MASK                  0x00000800
#define _G1CLUTRD_CLUTRD11_LENGTH                0x00000001

#define _G1CLUTRD_CLUTRD12_POSITION              0x0000000C
#define _G1CLUTRD_CLUTRD12_MASK                  0x00001000
#define _G1CLUTRD_CLUTRD12_LENGTH                0x00000001

#define _G1CLUTRD_CLUTRD13_POSITION              0x0000000D
#define _G1CLUTRD_CLUTRD13_MASK                  0x00002000
#define _G1CLUTRD_CLUTRD13_LENGTH                0x00000001

#define _G1CLUTRD_CLUTRD14_POSITION              0x0000000E
#define _G1CLUTRD_CLUTRD14_MASK                  0x00004000
#define _G1CLUTRD_CLUTRD14_LENGTH                0x00000001

#define _G1CLUTRD_CLUTRD15_POSITION              0x0000000F
#define _G1CLUTRD_CLUTRD15_MASK                  0x00008000
#define _G1CLUTRD_CLUTRD15_LENGTH                0x00000001

#define _G1MRGN_HBAMGN_POSITION                  0x00000000
#define _G1MRGN_HBAMGN_MASK                      0x000000FF
#define _G1MRGN_HBAMGN_LENGTH                    0x00000008

#define _G1MRGN_VBAMGN_POSITION                  0x00000008
#define _G1MRGN_VBAMGN_MASK                      0x0000FF00
#define _G1MRGN_VBAMGN_LENGTH                    0x00000008

#define _G1MRGN_HBAMGN0_POSITION                 0x00000000
#define _G1MRGN_HBAMGN0_MASK                     0x00000001
#define _G1MRGN_HBAMGN0_LENGTH                   0x00000001

#define _G1MRGN_HBAMGN1_POSITION                 0x00000001
#define _G1MRGN_HBAMGN1_MASK                     0x00000002
#define _G1MRGN_HBAMGN1_LENGTH                   0x00000001

#define _G1MRGN_HBAMGN2_POSITION                 0x00000002
#define _G1MRGN_HBAMGN2_MASK                     0x00000004
#define _G1MRGN_HBAMGN2_LENGTH                   0x00000001

#define _G1MRGN_HBAMGN3_POSITION                 0x00000003
#define _G1MRGN_HBAMGN3_MASK                     0x00000008
#define _G1MRGN_HBAMGN3_LENGTH                   0x00000001

#define _G1MRGN_HBAMGN4_POSITION                 0x00000004
#define _G1MRGN_HBAMGN4_MASK                     0x00000010
#define _G1MRGN_HBAMGN4_LENGTH                   0x00000001

#define _G1MRGN_HBAMGN5_POSITION                 0x00000005
#define _G1MRGN_HBAMGN5_MASK                     0x00000020
#define _G1MRGN_HBAMGN5_LENGTH                   0x00000001

#define _G1MRGN_HBAMGN6_POSITION                 0x00000006
#define _G1MRGN_HBAMGN6_MASK                     0x00000040
#define _G1MRGN_HBAMGN6_LENGTH                   0x00000001

#define _G1MRGN_HBAMGN7_POSITION                 0x00000007
#define _G1MRGN_HBAMGN7_MASK                     0x00000080
#define _G1MRGN_HBAMGN7_LENGTH                   0x00000001

#define _G1MRGN_VBAMGN0_POSITION                 0x00000008
#define _G1MRGN_VBAMGN0_MASK                     0x00000100
#define _G1MRGN_VBAMGN0_LENGTH                   0x00000001

#define _G1MRGN_VBAMGN1_POSITION                 0x00000009
#define _G1MRGN_VBAMGN1_MASK                     0x00000200
#define _G1MRGN_VBAMGN1_LENGTH                   0x00000001

#define _G1MRGN_VBAMGN2_POSITION                 0x0000000A
#define _G1MRGN_VBAMGN2_MASK                     0x00000400
#define _G1MRGN_VBAMGN2_LENGTH                   0x00000001

#define _G1MRGN_VBAMGN3_POSITION                 0x0000000B
#define _G1MRGN_VBAMGN3_MASK                     0x00000800
#define _G1MRGN_VBAMGN3_LENGTH                   0x00000001

#define _G1MRGN_VBAMGN4_POSITION                 0x0000000C
#define _G1MRGN_VBAMGN4_MASK                     0x00001000
#define _G1MRGN_VBAMGN4_LENGTH                   0x00000001

#define _G1MRGN_VBAMGN5_POSITION                 0x0000000D
#define _G1MRGN_VBAMGN5_MASK                     0x00002000
#define _G1MRGN_VBAMGN5_LENGTH                   0x00000001

#define _G1MRGN_VBAMGN6_POSITION                 0x0000000E
#define _G1MRGN_VBAMGN6_MASK                     0x00004000
#define _G1MRGN_VBAMGN6_LENGTH                   0x00000001

#define _G1MRGN_VBAMGN7_POSITION                 0x0000000F
#define _G1MRGN_VBAMGN7_MASK                     0x00008000
#define _G1MRGN_VBAMGN7_LENGTH                   0x00000001

#define _G1CHRX_CURPOSX_POSITION                 0x00000000
#define _G1CHRX_CURPOSX_MASK                     0x000007FF
#define _G1CHRX_CURPOSX_LENGTH                   0x0000000B

#define _G1CHRX_CURPOSX0_POSITION                0x00000000
#define _G1CHRX_CURPOSX0_MASK                    0x00000001
#define _G1CHRX_CURPOSX0_LENGTH                  0x00000001

#define _G1CHRX_CURPOSX1_POSITION                0x00000001
#define _G1CHRX_CURPOSX1_MASK                    0x00000002
#define _G1CHRX_CURPOSX1_LENGTH                  0x00000001

#define _G1CHRX_CURPOSX2_POSITION                0x00000002
#define _G1CHRX_CURPOSX2_MASK                    0x00000004
#define _G1CHRX_CURPOSX2_LENGTH                  0x00000001

#define _G1CHRX_CURPOSX3_POSITION                0x00000003
#define _G1CHRX_CURPOSX3_MASK                    0x00000008
#define _G1CHRX_CURPOSX3_LENGTH                  0x00000001

#define _G1CHRX_CURPOSX4_POSITION                0x00000004
#define _G1CHRX_CURPOSX4_MASK                    0x00000010
#define _G1CHRX_CURPOSX4_LENGTH                  0x00000001

#define _G1CHRX_CURPOSX5_POSITION                0x00000005
#define _G1CHRX_CURPOSX5_MASK                    0x00000020
#define _G1CHRX_CURPOSX5_LENGTH                  0x00000001

#define _G1CHRX_CURPOSX6_POSITION                0x00000006
#define _G1CHRX_CURPOSX6_MASK                    0x00000040
#define _G1CHRX_CURPOSX6_LENGTH                  0x00000001

#define _G1CHRX_CURPOSX7_POSITION                0x00000007
#define _G1CHRX_CURPOSX7_MASK                    0x00000080
#define _G1CHRX_CURPOSX7_LENGTH                  0x00000001

#define _G1CHRX_CURPOSX8_POSITION                0x00000008
#define _G1CHRX_CURPOSX8_MASK                    0x00000100
#define _G1CHRX_CURPOSX8_LENGTH                  0x00000001

